Tekla Open API Reference for Tekla Structures 2025
LineTypes Operators and Type Conversions
The LineTypes type exposes the following members.
Operators
Name | Description
Equality
 Returns true if the current object and the given object are equal.
Explicit(Int32 to LineTypes)
 Returns the corresponding LineTypes value of the given int value.
Explicit(LineTypes to Int32)
 Returns the corresponding int value of the given LineTypes value.
Inequality
 Returns true if the current object and the given object are not equal.
Top
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace